code-review/NRB_3471_3546/База_Стало/InformationRegisters/УведомленияОтправленныеЧерезЛичныйКабинет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УведомленияОтправленныеЧерезЛичныйКабинет</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатусДоставкиУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоставкиУведомленийВКабинетКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тело</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗапросСубброкеруНаРаскрытие</v8:Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеНаУчастиеВОферте</v8:Type>
						<v8:Type>cfg:TaskRef.ОбработкаWTRCСообщения</v8:Type>
						<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеКлиентам</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.ОбработкаWTRCСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/AccumulationRegisters/ОстаткиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦБ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.МестаХранения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попечитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/КодыЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КодыЗагрузки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.МестаХранения</xr:Item>
				<xr:Item>Catalog.СчетаДепо</xr:Item>
				<xr:Item>Catalog.СчетаДепоМХ</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
				<xr:Item>Catalog.ЦенныеБумаги</xr:Item>
				<xr:Item>Catalog.ЮридическиеЛица</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.ГруппаЦБДляНалогообложения</xr:Item>
				<xr:Item>Catalog.ТипыНалогов</xr:Item>
				<xr:Item>Catalog.Субклиенты</xr:Item>
				<xr:Item>Catalog.ТарифныеПланы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыЗагрузки</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/УведомленияОтправленныеЧерезЛичныйКабинет/Ext/ManagerModule.bsl
// Удаляет записи регистра с отбором Период+КД
// Добавляет в регистр по одной записи на каждую строку таблицы Клиенты
//
// Параметры:
//	ПериодЗаписи - дата
//	КД - ссылка на док.УведомлениеКлиентам, док. КорпоративноеДействие_Новый, док.РаскрытиеСпискаВладельцев, задача ОбработкаWTRCСообщения
//	Клиенты - таблица значений с полями: Клиент, Договор, СчетДепо, РазделСчетаДепо, ЦеннаяБумага, Количество
//
Процедура ЗафиксироватьУведомления(ПериодЗаписи, КД, Клиенты) Экспорт
	НаборЗаписей = РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ПериодЗаписи);
	НаборЗаписей.Отбор.КД.Установить(КД);
	НаборЗаписей.Записать(); // Удалить старые записи
	
	// Добавить клиентов из списка
	Для Каждого Строка из Клиенты Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ПериодЗаписи;
		НоваяЗапись.КД = КД;
		НоваяЗапись.СтатусДоставкиУведомления = Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ВыгруженИз1С;
		НоваяЗапись.ИдентификаторУведомления = Строка.MessageId;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Строка);
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

// Добавляет в регистр по одной записи на каждую строку таблицы Клиенты
//
// Параметры:
//	ПериодЗаписи - дата
//	КД - ссылка на док.УведомлениеКлиентам, док. КорпоративноеДействие_Новый, док.РаскрытиеСпискаВладельцев, задача ОбработкаWTRCСообщения
//	Клиенты - таблица значений с полями: Клиент, Договор, СчетДепо, РазделСчетаДепо, ЦеннаяБумага, Количество
//
Процедура ДобавитьКлиентов(ПериодЗаписи, КД, Клиенты) Экспорт
	
	Для Каждого Строка из Клиенты Цикл
		НоваяЗапись = РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период	= ПериодЗаписи;
		НоваяЗапись.КД		= КД;
		НоваяЗапись.СтатусДоставкиУведомления = Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ВыгруженИз1С;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Строка);
		НоваяЗапись.Записать();
	КонецЦикла;
КонецПроцедуры

// Получает клиентов, имеющих на указанную дату ценные бумаги ЦеннаяБумага1 или ЦеннаяБумага2
//
// Параметры:
//	ДатаОстатков - дата
//	ЦеннаяБумага1, ЦеннаяБумага2 - СправочникСсылка.ЦенныеБумаги
//
// Возвращаемое значение:
//	таблица значений
Функция КлиентыИмеющиеЦенныеБумаги(ДатаОстатков, ЦеннаяБумага1, ЦеннаяБумага2, СчетДепоМХ) Экспорт
	СписокЦБ = Новый Массив;
	Если ЗначениеЗаполнено(ЦеннаяБумага1) Тогда
		СписокЦБ.Добавить(ЦеннаяБумага1);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЦеннаяБумага2) Тогда
		СписокЦБ.Добавить(ЦеннаяБумага2);
	КонецЕсли;
	
	Возврат КлиентыИмеющиеЦенныеБумагиИзСписка(ДатаОстатков, СписокЦБ, СчетДепоМХ);
КонецФункции

// Получает клиентов, имеющих на указанную дату ценные бумаги из списка
//
// Параметры:
//	ДатаОстатков - дата
//	СписокЦенныхБумаг - массив значений СправочникСсылка.ЦенныеБумаги
//
// Возвращаемое значение:
//	таблица значений
Функция КлиентыИмеющиеЦенныеБумагиИзСписка(ДатаОстатков, СписокЦенныхБумаг, СчетДепоМХ) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо.Владелец КАК Клиент,
	|	Договоры.Ссылка КАК Договор,
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦеннаяБумага,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК Количество,
	|	ЕСТЬNULL(Договоры.ДатаНачалоДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоговора,
	|	ЕСТЬNULL(Договоры.Наименование, """") КАК НомерДоговора
	|ПОМЕСТИТЬ ВТ_ОстаткиЦБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&ДатаОстатков,
	|			ЦБ В (&СписокЦБ)
	|				И СчетДепоМХ = &СчетДепоМХ) КАК ОстаткиЦБОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО ОстаткиЦБОстатки.СчетДепо.Владелец = Договоры.Владелец
	|			И ОстаткиЦБОстатки.СчетДепо.Владелец.Код = Договоры.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиЦБ.Клиент КАК Клиент,
	|	ВТ_ОстаткиЦБ.Договор КАК Договор,
	|	ВТ_ОстаткиЦБ.СчетДепо КАК СчетДепо,
	|	ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепо.ПустаяСсылка) КАК РазделСчетаДепо,
	|	ВТ_ОстаткиЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_ОстаткиЦБ.Количество КАК Количество,
	|	КодыЗагрузки.Код КАК ClientId,
	|	ВЫБОР
	|		КОГДА КодыЗагрузки.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьКодЗагрузкиКлиенты,
	|	ВЫБОР
	|		КОГДА ВТ_ОстаткиЦБ.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ""физ""
	|		ИНАЧЕ ""юр""
	|	КОНЕЦ КАК ЮрФизЛицо,
	|	ВТ_ОстаткиЦБ.Клиент.Наименование КАК КлиентНаименование,
	|	ВТ_ОстаткиЦБ.ДатаДоговора КАК ДатаДоговора,
	|	ВТ_ОстаткиЦБ.НомерДоговора КАК НомерДоговора,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """")
	|		ИНАЧЕ ""клиент""
	|	КОНЕЦ КАК Фамилия,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Имя, """")
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ КАК Имя,
	|	ВТ_ОстаткиЦБ.Клиент.Субброкер КАК Субброкер
	|ИЗ
	|	ВТ_ОстаткиЦБ КАК ВТ_ОстаткиЦБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|			ПО Контрагенты.ЮридическиеФизическиеЛица = КодыЗагрузки.Владелец
	|				И (КодыЗагрузки.Биржа = &КлассификаторыЗагрузкиКлиенты)
	|				И (НЕ КодыЗагрузки.ПометкаУдаления)
	|				И (КодыЗагрузки.ДатаНачалаДействия <= &ДатаОстатка)
	|				И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ КодыЗагрузки.ДатаОкончанияДействия >= &ДатаОстатка)
	|		ПО ВТ_ОстаткиЦБ.СчетДепо.Владелец = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|				,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_ОстаткиЦБ.Клиент.ЮридическиеФизическиеЛица КАК КлиентЮридическиеФизическиеЛица
	|					ИЗ
	|						ВТ_ОстаткиЦБ КАК ВТ_ОстаткиЦБ)) КАК ФИОФизЛицСрезПоследних
	|		ПО ВТ_ОстаткиЦБ.Клиент.ЮридическиеФизическиеЛица = ФИОФизЛицСрезПоследних.ФизЛицо");
	Запрос.УстановитьПараметр("ДатаОстатков",	ДатаОстатков);
	Запрос.УстановитьПараметр("СписокЦБ",		СписокЦенныхБумаг);
	Запрос.УстановитьПараметр("СчетДепоМХ",		СчетДепоМХ);
	Запрос.УстановитьПараметр("КлассификаторыЗагрузкиКлиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	Если ТипЗнч(ДатаОстатков) = Тип("Граница") Тогда
		Запрос.УстановитьПараметр("ДатаОстатка", ДатаОстатков.Значение);
	Иначе
		Запрос.УстановитьПараметр("ДатаОстатка", ДатаОстатков);
	КонецЕсли;
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Получает клиентов которые не являются НД или ИНД, имеющих на указанную дату ценные бумаги из списка
//
// Параметры:
//	ДатаОстатков - дата
//	СписокЦенныхБумаг - массив значений СправочникСсылка.ЦенныеБумаги
//
// Возвращаемое значение:
//	таблица значений
Функция КлиентыНеНДИНДИмеющиеЦенныеБумагиИзСписка(ДатаОстатков, СписокЦенныхБумаг, СчетДепоМХ) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо.Владелец КАК Клиент,
	|	Договоры.Ссылка КАК Договор,
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	//|	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦеннаяБумага,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК Количество,
	|	КодыЗагрузкиКлиента.Код КАК ClientId
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&ДатаОстатков,
	|			ЦБ В (&СписокЦБ)
	|				И СчетДепоМХ = &СчетДепоМХ
	|				И НЕ СчетДепо.ТипСчетаДепо В (&ТипыСчетаДепоНДИНД)) КАК ОстаткиЦБОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО ОстаткиЦБОстатки.СчетДепо.Владелец = Договоры.Владелец
	|			И ОстаткиЦБОстатки.СчетДепо.Владелец.Код = Договоры.Код
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиента
	|		ПО ОстаткиЦБОстатки.СчетДепо.Владелец = КодыЗагрузкиКлиента.Владелец
	|			И (НЕ КодыЗагрузкиКлиента.ПометкаУдаления)
	|			И (КодыЗагрузкиКлиента.Биржа = &КлассификаторыЗагрузкиКлиенты)");
	Запрос.УстановитьПараметр("ДатаОстатков",	ДатаОстатков);
	Запрос.УстановитьПараметр("СписокЦБ",		СписокЦенныхБумаг);
	Запрос.УстановитьПараметр("СчетДепоМХ",		СчетДепоМХ);
	Запрос.УстановитьПараметр("КлассификаторыЗагрузкиКлиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	Запрос.УстановитьПараметр("ТипыСчетаДепоНДИНД",		БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовНДИНД());

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Получает клиентов которые являются НД или ИНД, имеющих на указанную дату ценные бумаги из списка
//
// Параметры:
//	ДатаОстатков - дата
//	СписокЦенныхБумаг - массив значений СправочникСсылка.ЦенныеБумаги
//
// Возвращаемое значение:
//	таблица значений
Функция КлиентыНДИНДИмеющиеЦенныеБумагиИзСписка(ДатаОстатков, СписокЦенныхБумаг, СчетДепоМХ) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо.Владелец КАК Клиент,
	|	Договоры.Ссылка КАК Договор,
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	//|	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦеннаяБумага,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК Количество,
	|	КодыЗагрузкиКлиента.Код КАК ClientId
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&ДатаОстатков,
	|			ЦБ В (&СписокЦБ)
	|				И СчетДепоМХ = &СчетДепоМХ
	|				И СчетДепо.ТипСчетаДепо В (&ТипыСчетаДепоНДИНД)) КАК ОстаткиЦБОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО ОстаткиЦБОстатки.СчетДепо.Владелец = Договоры.Владелец
	|			И ОстаткиЦБОстатки.СчетДепо.Владелец.Код = Договоры.Код
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиента
	|		ПО ОстаткиЦБОстатки.СчетДепо.Владелец = КодыЗагрузкиКлиента.Владелец
	|			И (НЕ КодыЗагрузкиКлиента.ПометкаУдаления)
	|			И (КодыЗагрузкиКлиента.Биржа = &КлассификаторыЗагрузкиКлиенты)");
	Запрос.УстановитьПараметр("ДатаОстатков",	ДатаОстатков);
	Запрос.УстановитьПараметр("СписокЦБ",		СписокЦенныхБумаг);
	Запрос.УстановитьПараметр("СчетДепоМХ",		СчетДепоМХ);
	Запрос.УстановитьПараметр("КлассификаторыЗагрузкиКлиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	Запрос.УстановитьПараметр("ТипыСчетаДепоНДИНД",		БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовНДИНД());

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Устанавливает новый статус доставки для записей с указанным отбором
//
// Параметры:
//	ДокументУведомления - ссылка на документ УведомлениеКлиентам для отбора записей
//	Клиент - ссылка на спр. Контрагенты для отбора записей
//	СтатусДоставки - перечисление СтатусыДоставкиУведомленийВКабинетКлиента для отбора записей
//	НовыйСтатусДоставки - перечисление СтатусыДоставкиУведомленийВКабинетКлиента для установки
Процедура УстановитьСтатусДоставки(ДокументУведомления, Клиент, СтатусДоставки, НовыйСтатусДоставки) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РегистрУведомлений.Период КАК Период,
	|	РегистрУведомлений.КД КАК КД,
	|	РегистрУведомлений.Клиент КАК Клиент,
	|	РегистрУведомлений.Договор КАК Договор,
	|	РегистрУведомлений.СчетДепо КАК СчетДепо,
	|	РегистрУведомлений.РазделСчетаДепо КАК РазделСчетаДепо,
	|	РегистрУведомлений.ЦеннаяБумага КАК ЦеннаяБумага,
	|	РегистрУведомлений.Количество КАК Количество,
	|	РегистрУведомлений.ИдентификаторУведомления КАК ИдентификаторУведомления
	|ИЗ
	|	РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК РегистрУведомлений
	|ГДЕ
	|	(РегистрУведомлений.КД = &ДокументУведомления
	|				И РегистрУведомлений.Клиент = &Клиент
	|				И РегистрУведомлений.СтатусДоставкиУведомления = &СтатусДоставки
	|				И (РегистрУведомлений.КД ССЫЛКА Документ.УведомлениеКлиентам
	|					ИЛИ РегистрУведомлений.КД ССЫЛКА Документ.Поручение)
	|			ИЛИ РегистрУведомлений.КД ССЫЛКА Документ.ЗаявлениеНаУчастиеВОферте)
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет");
	Запрос.УстановитьПараметр("ДокументУведомления", ДокументУведомления);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("СтатусДоставки", СтатусДоставки);
	
	НачатьТранзакцию();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МЗ = РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка, "Период, КД, Клиент, Договор, СчетДепо, РазделСчетаДепо, ЦеннаяБумага, ИдентификаторУведомления");
		МЗ.Прочитать();
		МЗ.Количество = Выборка.Количество;
		МЗ.СтатусДоставкиУведомления = НовыйСтатусДоставки;
		МЗ.Записать();
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры
